def area(a, b):
    '''
    Вычисляет площадь прямоугольника.

    Параметры:
    a (int или float): первая сторона прямоугольника
    b (int или float): вторая сторона прямоугольника

    Возвращаемое значение:
    area (int или float): площадь прямоугольника (a * b)
    '''
    return a * b


def perimeter(a, b):
    '''
    Вычисляет периметр прямоугольника.

    Параметры:
    a (int или float): первая сторона прямоугольника
    b (int или float): вторая сторона прямоугольника

    Возвращаемое значение:
    perimeter (int или float): периметр прямоугольника (2 * (a + b))
    '''
    return (a + b) * 2