
def area(a):
    '''
    Вычисляет площадь квадрата по заданной длине стороны.

    Параметры:
    a (int или float): Длина стороны квадрата.

    Возвращаемое значение:
    area (int или float): Площадь квадрата (a * a).
    '''
    return a * a


def perimeter(a):
    '''
    Вычисляет периметр квадрата по заданной длине стороны.

    Параметры:
    a (int или float): Длина стороны квадрата.

    Возвращаемое значение:
    perimeter (int или float): Периметр квадрата (4 * a).
    '''
    return 4 * a
